app/controllers/school_classes_controller.rb

  def update
    find_school_class
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "THIS IS A CLASSes"], ["room_number", nil], ["updated_at", "2018-11-24 17:34:16.597386"], ["id", 9]]

  def find_school_class
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", nil]]