app/controllers/students_controller.rb

  def create
    @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "BOBFISH"], ["last_name", "SALERNO"], ["created_at", "2018-11-24 17:24:58.127301"], ["updated_at", "2018-11-24 17:24:58.127301"]]